cat_app/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)

    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "sex", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["birth_date", "2015-05-12 19:00:40.817860"], ["color", "RED"], ["name", "Gizmo"], ["sex", "M"], ["created_at", "2015-05-12 19:00:40.870944"], ["updated_at", "2015-05-12 19:00:40.870944"]]

  def update
    @cat = Cat.find(params[:id])
    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT 1  [["id", 29]]
UPDATE "cats" SET "birth_date" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["birth_date", "55555-05-05 00:00:00.000000"], ["description", ""], ["updated_at", "2015-05-13 00:23:41.453242"], ["id", 26]]