w4d3/NinetyNineCats/app/views/cats/show.html.erb

SELECT "cat_rental_requests".* FROM "cat_rental_requests"  WHERE "cat_rental_requests"."cat_id" = $1  ORDER BY "cat_rental_requests"."start_date" ASC  [["cat_id", 6]]
---
  </tr>
  <% @cat.rental_requests.includes(:renter).order("start_date").each do |req| %>