app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? ORDER BY "articles"."id" ASC LIMIT 1  [["id", 1]]
---
  def show
    @article = Article.find(params[:id])

INSERT INTO "articles" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "Body of article 5"], ["created_at", Sun, 10 May 2015 09:23:38 UTC +00:00], ["title", "Article 5"], ["updated_at", Sun, 10 May 2015 09:23:38 UTC +00:00]]
---
  def create
    @article = Article.new(article_params)

    flash.notice = "Article '#{@article.title}' Created!"
    #
    # @article = Article.new(params[:article])

    # { title: 'title_here', body: 'bod' }
    #
    #
    # @article = Article.new(
    #   title: params[:article][:title],
    #   body: params[:article][:body]
    # )


    # @article.title = params[:article][:title]
    # @article.body = params[:article][:body]
    @article.save